-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: database-1.ci2hp2jo8ok0.ap-northeast-2.rds.amazonaws.com    Database: webgyver
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '';

--
-- Table structure for table `seller`
--

DROP TABLE IF EXISTS `seller`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `seller` (
  `idx` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) DEFAULT NULL,
  `updated_at` datetime(6) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `birth_day` date DEFAULT NULL,
  `book_time` varchar(255) DEFAULT NULL,
  `company_description` varchar(255) DEFAULT NULL,
  `comapny_image` varchar(255) DEFAULT NULL,
  `company_name` varchar(255) DEFAULT NULL,
  `company_number` varchar(255) DEFAULT NULL,
  `company_time` varchar(255) DEFAULT NULL,
  `detail_address` varchar(255) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `id` varchar(50) DEFAULT NULL,
  `lat` double DEFAULT NULL,
  `lng` double DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `phone_number` varchar(255) DEFAULT NULL,
  `point` int DEFAULT NULL,
  `profile_image` varchar(255) DEFAULT NULL,
  `representative_name` varchar(255) DEFAULT NULL,
  `review_count` bigint DEFAULT '0',
  `star_total` bigint DEFAULT '0',
  PRIMARY KEY (`idx`),
  UNIQUE KEY `UK_4ck369oqdntt9x45kqe8jb17y` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `seller`
--

LOCK TABLES `seller` WRITE;
/*!40000 ALTER TABLE `seller` DISABLE KEYS */;
INSERT INTO `seller` VALUES (1,'2023-02-14 13:41:28.581000','2023-02-14 13:41:28.581000','충청북도 음성군 대소면 대금로','2000-11-04','월요일$13:00~18:00%화요일$10:00~18:00%수요일$휴일%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%','안녕하세요 늘 최선을 다하는 다성산업입니다.\n\n저희 다성산업은 다음의 두가지를 약속드리겠읍니다.\n\n첫번째 신뢰입니다.\n고객과의 신뢰를 져버리지 않는, 저희 다성산업이 되겠읍니다.\n두번째 최고의 품질입니다.\n최고의 전문가가 최고의 품질을 약속드립니다.\n\n불편사항은 연락 부탁드리겠읍니다.','25f9a454449ac41e050cd1246f01850b3656e12fa42972940c2c602588c7645e.png','다성산업','2248701436','월요일$휴일%화요일$휴일%수요일$휴일%목요일$휴일%금요일$휴일%토요일$휴일%일요일$휴일%공휴일$휴일%','5-71번길','3','qkrdlfrb12',36.9673180451735,127.540351081406,'박일규','$2a$10$z6L8ecr5AA8yEA.t4POXM.4GD0JMUa3z7ZQNUCzoL8VZtrk9t7i6G','01000000000',5500,'12e654f98a74da2640e0cbb1c5e7704fd027634196b8679ef2584c915f489160.png','박일규',1,4),(2,'2023-02-14 14:04:12.884000','2023-02-14 14:04:12.884000','대전 유성구 궁동로 5','1994-11-03','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$10:00~16:00%일요일$휴일%공휴일$휴일%','가벼운 화상 상담 한번으로 문제가 해결되어 버리면 마치 마술이라고 느껴지실 겁니다. \n\n- 작은 문제라도 꼼꼼히 봐드립니다.\n- 문의 주신 내용 해결 되어도 상담시간 동안 다른 부분 추가로 문의 가능합니다.\n- 출장비는 거리 무관 18,000원입니다.','defaultBgImage.png','수리수리마수리','3758700088',NULL,'102호','1','dlagmltkd',36.3618201150586,127.346913690935,'임희상','$2a$10$cqIRGYirKrk489a4s6olKuzDhOBteZYDOBRFNmJoLo3HmtfPdiNBq','01000000000',35330,'dca219e83bad4949508782220c37c7749f53ac5ebb0066e27ea89450fd1d06f8.jpg','임희상',8,35),(3,'2023-02-14 16:25:11.379000','2023-02-14 16:25:11.379000','충남 천안시 동남구 공설시장1길 2','2000-11-04','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$09:00~18:00%','★ 배송 정책 ★\n\n당일 오전에 결제된 부분에 관해서는 당일 출고를 기본으로 합니다.  (배송기간은 7일 이내)\n\n단,  출고 시간이나 특정 상품 입고에 따라 배송기간이 지연될수 있습니다.','defaultBgImage.png','성창철물상회','1428166402',NULL,'203-41번길','3','qkrdlfrb23',36.8092062478148,127.148898832528,'박이규','$2a$10$yRG1kqGDBuBUdc0UXL4yEuGtWZhq82DzY50Ve8eyVKM2qZ3BoA2OG','01000000000',0,'cb0d7819171a464f1e9546a9278503405f816e5bbb5c1d21b2a11ae87f87e2ca.PNG','박이규',1,3),(4,'2023-02-14 16:26:05.635000','2023-02-14 16:26:05.635000','대전 유성구 덕명동 596-3','1997-12-15','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$휴일%일요일$휴일%공휴일$휴일%','                  * 국내 최대 규모 *\n2000년 주식회사 동준종합철물 설립!!\n500평 규모 대형 오프라인 매장 운영중\n                 수리가 어려우시다면 \n                 언제든 문의 주세요!\n수리가 필요한 부분을 찍어서 예약 상담 클릭!\n여러분의 문제를 빠르게 처리해 드리겠습니다.\n                      동준종합철물','23839f6d274660e5216e7b5a9ae0b81b47af9d320f67cf5aa554a970c36c2b36.png','동준종합철물','3758700088','월요일$09:00~18:00%화요일$휴일%수요일$휴일%목요일$09:00~18:00%금요일$09:00~18:00%토요일$휴일%일요일$휴일%공휴일$휴일%','503호','1','rlaehdwns',36.3480924058093,127.297631033996,'김동준','$2a$10$cZpotDbIE0mo0B7v/GGSGO0M5AdPWmqsCul42V0ll64zAmqZ/Rb2m','01000000000',17000,'7f2e587759ea789ec0d8a85eedf51ddae99f57130feedae71b47702f2adefeb0.png','김동준',3,13),(5,'2023-02-14 16:32:20.587000','2023-02-14 16:32:20.587000','대전 유성구 덕명서로8번길 39','1994-05-22','월요일$09:00~20:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$09:30~22:30%','안녕하십니까~!! 수리 Ssaf 고수 Shop 입니다.\n저희 업체 종합 수리업에서 오랜 기간 숙련된 기술을 보유하고 있습니다.\n담당자 김성중 010-5982-9482(언제든지 전화주세요~)\n\n!  연중무휴 입니다.\n!  과다정비 절대 사양합니다.\n!  대전유일 웹가이버 7년이상 고객유치중\n\n고객님의 제품 저의 재산과 같이 생각하고 정비합니다.\n24시간 언제나 대화 가능합니다.\n수리작업은 어느 정비업체보다 프라이드를 갖고 구비하고 있습니다.','5316f5031b904bac5a8989b5927e93a4591b26bb72e958cde2b4550cce01ef59.jpg','수리 Ssaf 고수 Shop','3758700088','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%','1층','1','wjsehddls',36.3590706805842,127.303274054858,'김성중','$2a$10$s4E6Z/l4CMrcnl7hxvLiquftPv4mz0yBElW8yZ5/uMhDoOwwinIPu','01000000000',27000,'e9a4f4b4b534409460101eb1991258573186af233b85d33464b53d78341e6701.png','김성중',5,22),(6,'2023-02-14 16:42:46.706000','2023-02-14 16:42:46.706000','대전 유성구 계룡로 84','1997-08-16','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~12:00%일요일$12:00~18:00%공휴일$휴일%','⭐️고객만족도평가 1위⭐️\n✌친절+만족+감동+아트로 보답하겠습니다^^\n\n오랜 현장 경험과 노하우를 바탕으로 차별화된 서비스를 제공하며 꼼꼼한 마무리로 최선을 다하고 있습니다. \n후회 없는 선택으로 보답 하겠습니다.','9d5c377a551643f215cabea43d2df157f2619c7b5f9e07f0c2f3d0101d562f4e.jpg','마스터수리','3758700088','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%','101호','1','masterHeo',36.3537893829894,127.339985431198,'허윤회','$2a$10$XFyURIfj9n5/HxU9cg/JHuERyT1I4g94flk97UD3LZLRitMDwKh9a','01000000000',100271,'4977ede2b056cde68bd266e369328fad98657607efd0cf08c23017b2d46939ad.jpg','허윤회',6,30),(7,'2023-02-15 08:32:47.251000','2023-02-15 08:32:47.251000','대전 유성구 동서대로 49','1994-11-03','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$휴일%일요일$휴일%공휴일$휴일%','2021년 개업!!!!!!!!!!!!!\n\n최신식 수리 설비와 친절한 서비스로 모시겠습니다. 전기, 수도 등 가리지 않고 봐드립니다.\n\n실시간 상담은 무료로 도와드립니다!\n\n좋은 후기와 평점 부탁드립니다!','defaultBgImage.png','강정전기 & 부품','3758700088',NULL,'101호','1','dlagmltkd1',36.355962332946,127.303029814281,'강정훈','$2a$10$MIbn6UMhg1HcxIU4i8KGwuueHC.DChWZRf5Pt0mqcN1vh4zMqBU52','01000000000',0,'96fbcbb819794eb26a994d74863ad743d2db506963078d7bc642b71d017e69e8.jpg','강정훈',0,0),(8,'2023-02-15 08:38:58.492000','2023-02-15 08:38:58.492000','서울 성동구 뚝섬로 310','1994-11-03','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$휴일%공휴일$휴일%','2006년 개점하여 현재까지 영업중인 대머리독 수리 종합 수리점입니다. 세월이 흘러 저의 머리는 남아있지 않지만 그 만큼 실력을 쌓았습니다. \n\n양심적인 견적과 확실한 처리 보장하겠습니다.','defaultBgImage.png','대머리독 수리','3758700088',NULL,'103호','1','dlagmltkd2',37.5407784221481,127.045773499507,'박진우','$2a$10$4zhcyKB7K5GpTDK0AVmmw.oViNe.Hp.zPjXXhWUy0EPbwXX8RNwES','01000000000',0,'8b3576899d7e87e276cc4b604a2d5abbdb4cb7c24da1697653c4519e48d48377.jpg','박진우',0,0),(9,'2023-02-15 09:05:01.876000','2023-02-15 09:05:01.876000','대전 유성구 월드컵대로 32','1994-11-03','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$09:00~18:00%','제가 LA에 있을때는 말이죠 정말 제가 꿈에 무대인 메이저리그로 진출해서 가는 식당마다 싸인해달라 기자들은 항상 붙어다니며 취재하고 제가 그 머~ 어~ 대통령이 된 기분이였어요 그런데 17일만에 17일만에 마이너리그로 떨어졌어요 못던져서 그만두고 그냥 확 한국으로 가버리고 싶었어요 그래서 집에 가는길에 그 맥주6개 달린거 있잖아요 그전에는 술먹으면 야구 못하는줄 알았어요 그냥 한국으로 가버릴려구.... 그리고 맥주 6개먹고 확 죽어버릴려고 그랬어요 야구','defaultBgImage.png','다저스 종합 수리','3758700088',NULL,'104호','1','dlagmltkd3',36.3619662173402,127.323555313924,'박찬호','$2a$10$xn0y3txNca9XVg76AQ4xkuVBKXYrOgMp/e59/QUsIDKDOVvFh43Uy','01000000000',4000,'c7abcf717b74c4b1383d7bd3d3f459306839302c0fc543d2a30fe952668c583f.jpg','박찬호',0,0),(10,'2023-02-15 10:20:56.997000','2023-02-15 10:20:56.997000','대전 유성구 덕명동 13','1994-05-22','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%',NULL,'defaultBgImage.png','닌자코더디지털','3758700088',NULL,'301호','1','wjsehddls1',36.3452663484108,127.305261969401,'임범규','$2a$10$YpO7M7SlL5G1IodWvLF6heCNr0b6mIdEBOHxFXGA.ch9QDNqXHEs2','01000000000',0,'2d22ec6ee388f651a11c320f128da169dddb3032b2631ac670a24aa16de02c2d.webp','임범규',0,0),(11,'2023-02-15 10:24:25.912000','2023-02-15 10:24:25.912000','부산 금정구 중앙대로 1614','1994-05-22','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%',NULL,'defaultBgImage.png','민우창호전자','3758700088',NULL,'1911호','1','wjsehddls2',35.2284205166925,129.090827837632,'전동인','$2a$10$2DPeN1BdcR5.ICBYOsvY5uPODB7JPJMEJjdi6nJ20yzjAV.u70fUW','01000000000',0,'defaultProfileImage.png','정민우',0,0),(12,'2023-02-15 22:10:39.003000','2023-02-15 22:10:39.003000','대전 유성구 덕명서로8번길 39','1994-05-22','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%',NULL,'defaultBgImage.png','동인창호','3758700088',NULL,'1층','1','wjsehddls3',36.3590706805842,127.303274054858,'전동인','$2a$10$3L4evFyOPMbzrx.24IEwp.RQPFfzjnQjm1pCcxRT0gkFT.hJ61Bru','01000000000',0,'defaultProfileImage.png','전동인',0,0),(13,'2023-02-16 19:13:57.577000','2023-02-16 19:13:57.577000','울산 북구 가대서길 25','1994-05-22','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%',NULL,'407aac0216279097d5ceaaec35dfe00e5bbc4dcc2212607b64b5f6db9b027ff0.jpg','김인테리어','3758700088',NULL,'102호','1','wjsehddls4',35.6041411580898,129.310928469414,'김인태','$2a$10$c1t5Lbq2SiUJKqmJdesDvuns5n2BpEGmW6lej3e1nsvRKPcrGV3C.','01000000000',0,'43850a1b98798c7ec9b5ef36615d87fafd1b210d392508bd8acb4e0ad1d8bee9.jpg','김인태',0,0),(14,'2023-02-16 19:17:25.743000','2023-02-16 19:17:25.743000','경북 안동시 강남11길 13','1994-05-22','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%',NULL,'defaultBgImage.png','창호자재닷컴','3758700088','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$09:00~18:00%공휴일$휴일%','1011호','1','wjsehddls5',36.5482170542704,128.73698780593,'신설기','$2a$10$fXwAVH2hMn1hVWMPDkkYjODlE7kIwLk0.u/qLKcnMTRT7pJcd7ewC','01000000000',0,'49e3c2bc7978cafb810595ea67897b9c412302600236009af4bc4a548c293262.jpg','신설기',0,0),(15,'2023-02-16 22:05:41.783000','2023-02-16 22:05:41.783000','대전 유성구 덕명동 150-2','1997-08-16','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$휴일%공휴일$휴일%',NULL,'defaultBgImage.png','아이조아콤퓨타','3758700088','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$09:00~18:00%일요일$휴일%공휴일$휴일%','본관 A101호','1','masterheo2',36.3452663484108,127.305261969401,'허준회','$2a$10$vJruZ6AZKhXMssNEa.iFXOLYzbvO7FQDFnyqDIFDZpiAndyIFFxdq','01000000000',0,'defaultProfileImage.png','허준회',0,0),(16,'2023-02-16 22:09:23.577000','2023-02-16 22:09:23.577000','대전 유성구 현충원로 지하 455','1997-08-16','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$휴일%일요일$휴일%공휴일$휴일%',NULL,'defaultBgImage.png','KGC창호','3758700088','월요일$09:00~18:00%화요일$09:00~18:00%수요일$09:00~18:00%목요일$09:00~18:00%금요일$09:00~18:00%토요일$휴일%일요일$휴일%공휴일$휴일%','B03호','1','masterheo3',36.3589851664449,127.321973902899,'허영욱','$2a$10$kOgMJ9j0elt2VmcPfa9YDuhtryzZJs42.G7.6MEKfCSzfDiSNYglW','01000000000',0,'defaultProfileImage.png','허영욱',0,0);
/*!40000 ALTER TABLE `seller` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-17  1:25:15
